In [6]:
import numpy as np
import pandas as pd

In [8]:
from numpy.random import randn

In [9]:
np.random.seed(101)

In [11]:
df=pd.DataFrame(randn(5 , 4) , ['A' ,'B' , 'C' , 'D' , 'E'] , ['W' , 'X' , 'Y' ,'Z'])

In [12]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [13]:
df >0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [14]:
df[df > 0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [16]:
df['W'] >0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [19]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [24]:
resultdf=df[df['W'] > 0]

In [21]:
df['Z']

A   -1.159119
B    0.184502
C    0.329646
D    0.484752
E    1.996652
Name: Z, dtype: float64

In [22]:
df['Z'] <0

A     True
B    False
C    False
D    False
E    False
Name: Z, dtype: bool

In [23]:
df[df['Z'] < 0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [25]:
resultdf

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [26]:
resultdf['W']

A    0.302665
C    0.807706
Name: W, dtype: float64

In [27]:
resultdf.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [28]:
df[df['W'] > 0]['X']

A    1.693723
C    0.072960
Name: X, dtype: float64

In [30]:
df[df['Z']   < 0]['Z']

A   -1.159119
Name: Z, dtype: float64

# step by step

In [31]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [39]:
boolser=df['W'] < 0

In [40]:
boolser

A    False
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [42]:
resultdf=df[boolser]

In [43]:
resultdf

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [44]:
resultdf[['X' , 'Z']]

          X         Z
B  0.390528  0.184502
D -0.754070  0.484752
E  1.901755  1.996652

# One line

In [45]:
df[df['W'] < 0][['X' , 'Z']]  # one line

          X         Z
B  0.390528  0.184502
D -0.754070  0.484752
E  1.901755  1.996652

In [46]:
# Multiple selection

In [47]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [48]:
df[(df['W'] > 0.16) & (df['Y'] > 0.63)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [49]:
df['W'] > 0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [52]:
df['Y'] > 0.63

A    False
B    False
C     True
D    False
E    False
Name: Y, dtype: bool

In [54]:
# here and gets confused with multiple boolean values as it can work only with two boolean at a time 
# hence & is used

In [55]:
#reset index

In [56]:
reset=df.reset_index()

In [57]:
reset

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [58]:
reset['index']

0    A
1    B
2    C
3    D
4    E
Name: index, dtype: object

In [61]:
new_state='CA NY WY OR CO'.split()

In [62]:
new_state

['CA', 'NY', 'WY', 'OR', 'CO']

In [67]:
df['State'] = new_state

In [69]:
df

          W         X         Y         Z State
A  0.302665  1.693723 -1.706086 -1.159119    CA
B -0.134841  0.390528  0.166905  0.184502    NY
C  0.807706  0.072960  0.638787  0.329646    WY
D -0.497104 -0.754070 -0.943406  0.484752    OR
E -0.116773  1.901755  0.238127  1.996652    CO

In [71]:
df.set_index('State')

              W         X         Y         Z
State
CA     0.302665  1.693723 -1.706086 -1.159119
NY    -0.134841  0.390528  0.166905  0.184502
WY     0.807706  0.072960  0.638787  0.329646
OR    -0.497104 -0.754070 -0.943406  0.484752
CO    -0.116773  1.901755  0.238127  1.996652

In [72]:
df

          W         X         Y         Z State
A  0.302665  1.693723 -1.706086 -1.159119    CA
B -0.134841  0.390528  0.166905  0.184502    NY
C  0.807706  0.072960  0.638787  0.329646    WY
D -0.497104 -0.754070 -0.943406  0.484752    OR
E -0.116773  1.901755  0.238127  1.996652    CO